In [1]:
import pandas as pd
import numpy as np
from scipy import stats

# Q1

In [7]:
data = pd.read_csv("Cutlets.csv")

In [8]:
p_val = stats.ttest_ind(data["Unit A"], data["Unit B"])

In [9]:
p_val[1]

0.4722394724599501

# Q2

In [13]:
data2 = pd.read_csv("LabTAT.csv")
data2

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [14]:
p_val2 = stats.f_oneway(data2["Laboratory 1"], data2["Laboratory 2"], data2["Laboratory 3"], data2["Laboratory 4"])

In [17]:
p_val2[1]

2.1156708949992414e-57

# Q3

In [20]:
data3 = pd.read_csv("BuyerRatio.csv")

In [42]:
data3

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [43]:
table = [[50, 142, 131, 70], [435, 1523, 1356, 750]]

In [44]:
stats.chi2_contingency(table)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

# Q4

In [45]:
data4 = pd.read_csv("Costomer+OrderForm.csv")

In [46]:
data4

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [48]:
print(data4.Phillippines.value_counts())
print(data4.Indonesia.value_counts())
print(data4.Malta.value_counts())
print(data4.India.value_counts())

Error Free    271
Defective      29
Name: Phillippines, dtype: int64
Error Free    267
Defective      33
Name: Indonesia, dtype: int64
Error Free    269
Defective      31
Name: Malta, dtype: int64
Error Free    280
Defective      20
Name: India, dtype: int64

In [49]:
table2 = [[271, 267, 269, 280], [29, 33, 31, 20]]

In [50]:
stats.chi2_contingency(table2)

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))